### Pandas - DataFrame and Series

Pandas is a powerful data manipulation library in python,widely used for data analysis and data cleaning.

Series = one diensional 

DataFrame = two dimensional

In [48]:
import pandas as pd

In [49]:
#Series = one-dimensional array-like object that can hold any data type.

import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [50]:
#Create a Series from dictionary 
data = {'a':1,'b':2,'c':3} #keys have  become the index
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [51]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index = index)

a    10
b    20
c    30
dtype: int64

In [52]:
## Dataframe
## Create a Dataframe from a dictionary of list
data = {
    'Name':['harshini','Aryan','Chandu'],
    'Age':[19,22,49],
    'City': ['medchal','kali mandir','Borabanda']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age         City
0  harshini   19      medchal
1     Aryan   22  kali mandir
2    Chandu   49    Borabanda
<class 'pandas.core.frame.DataFrame'>

In [53]:
import numpy as np 
np.array(df)

array([['harshini', 19, 'medchal'],
       ['Aryan', 22, 'kali mandir'],
       ['Chandu', 49, 'Borabanda']], dtype=object)

In [54]:
## Create  a Data frame from a list of Dictionaries

data = [
    {'Name':'harshini','Age':19,'City':'medchal'},
    {'Name':'Aryan','Age':22,'City':'kali mandir'},
    {'Name':'Chandu','Age':49,'City':'Borabanda'}
    
]
df1 = pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age         City
0  harshini   19      medchal
1     Aryan   22  kali mandir
2    Chandu   49    Borabanda
<class 'pandas.core.frame.DataFrame'>

In [ ]:
df =pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [56]:
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [57]:
### Accessing Data from DataFrame
df1

       Name  Age         City
0  harshini   19      medchal
1     Aryan   22  kali mandir
2    Chandu   49    Borabanda

In [ ]:
df1['Name']

pandas.core.series.Series

In [61]:
type(df1['Name'])

pandas.core.series.Series

In [63]:
df1.loc[0]

Name    harshini
Age           19
City     medchal
Name: 0, dtype: object

In [66]:
df1.iloc[0][2]

/var/folders/l0/psvpx6h10k9b8ld12yw2yg880000gn/T/ipykernel_2442/1028912939.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df1.iloc[0][2]

'medchal'

In [67]:
## Accessing specified element
df1['Name']

0    harshini
1       Aryan
2      Chandu
Name: Name, dtype: object

In [70]:
df1.at[2,'Age']

np.int64(49)

In [71]:
df1.at[2,'Name']

'Chandu'

In [72]:
## Accessing a specified element using iat
df1.iat[2,2]

'Borabanda'

In [73]:
### Data Manipulation with Dataframe
df1

       Name  Age         City
0  harshini   19      medchal
1     Aryan   22  kali mandir
2    Chandu   49    Borabanda

In [ ]:
#Adding a columnn
df1['Salary'] = [80000 , 18000 , 40000 ]
df1

       Name  Age         City  Salary
0  harshini   19      medchal   80000
1     Aryan   22  kali mandir   18000
2    Chandu   49    Borabanda   40000

In [ ]:
## Remove a Column
#not a permanent operation
df1.drop('Salary',axis = 1)

       Name  Age         City
0  harshini   19      medchal
1     Aryan   22  kali mandir
2    Chandu   49    Borabanda

In [ ]:
df1

       Name  Age         City  Salary
0  harshini   19      medchal   80000
1     Aryan   22  kali mandir   18000
2    Chandu   49    Borabanda   40000

In [77]:
#to make permamnent 
df1.drop('Salary',axis = 1,inplace = True)

In [78]:
df1

       Name  Age         City
0  harshini   19      medchal
1     Aryan   22  kali mandir
2    Chandu   49    Borabanda

In [ ]:
## Add age to the column 
df1['Age'] = df1['Age'] + 1
df1

       Name  Age         City
0  harshini   20      medchal
1     Aryan   23  kali mandir
2    Chandu   50    Borabanda

In [83]:
df1.drop(0,inplace = True)

In [84]:
df1

     Name  Age         City
1   Aryan   23  kali mandir
2  Chandu   50    Borabanda

In [86]:
df =pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [90]:
#Display the data types of each column 
print("Data Types:\n",df.dtypes)

#Describe the DataFrame
print("Statistical summary:\n",df.describe())

Data Types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000